Revit 2027 API
VertexStreamPositionNormalColored Class
 A stream that can be used to write vertices of type VertexPositionNormalColored into a buffer (see VertexBuffer).
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.DirectContext3D.VertexStream
 Autodesk.Revit.DB.DirectContext3D.VertexStreamPositionNormalColored
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class VertexStreamPositionNormalColored : VertexStream
Public Class VertexStreamPositionNormalColored
	Inherits VertexStream
public ref class VertexStreamPositionNormalColored : public VertexStream
type VertexStreamPositionNormalColored =
    class
        inherit VertexStream
    end
The VertexStreamPositionNormalColored type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from VertexStream)
Top
Methods
Name | Description
AddVertex |  Inserts a VertexStreamPositionNormalColored into the stream and associated buffer.
AddVertices |  Inserts multiple VertexStreamPositionNormalColored instances into the stream and associated buffer.
Dispose
(Inherited from VertexStream)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB.DirectContext3D Namespace